//Задача 1: Парне чи непарне

//Напиши код, який запитує у користувача число і перевіряє:

//Якщо число парне → вивести "Число парне"

//Якщо число непарне → вивести "Число непарне"

//Підказка: використовуй оператор % для перевірки остачі від ділення.

const number = Number(prompt("Введіть число"));

if (number % 2 === 0) {
    alert("Число парне");
} else {
    alert("Число непарне");
}


//Задача 2: Парне чи непарне
const numbers = Number(prompt ("enter a number") );
if (numbers % 2 === 0) {
    alert ("even number"); 

    } else {
        alert ("odd number");

    }
    

//Задача 3: Вік користувача

//Запитай у користувача його вік і виведи повідомлення:

//Якщо вік менше 18 → "Ви ще не дорослі"

//Якщо від 18 до 60 включно → "Ви дорослі"

//Якщо більше 60 → "Ви пенсіонер"

const age = Number (prompt ("How old are you?"));
if (age <= 18) {
   alert ("you are young");

  } else if  (age > 18 && age <= 60) {;
    alert ("you are an adult"); 

  } else { 
    alert ("You are a pensioner!");

  }
   

